a = 10 // призначили змінній а значення 10
b = 10 // призначили змінній b значення 10
c = 20 // призначили змінній с значення 20
d = 50 // призначили змінній d значення 50
b++ // призначили змінній b збільшення на 1
console. log('Roman') // Обєкт, точетна запись, метод, виклик метода(значення тиму "String")
console. log('abc')// повертає 'abc'
console. log(10) // повертає 10
console. log(a + b) // повертає cуму 'a' + 'b' результат: a10 + b10 + (b++)1 = 21
console. log('Доброго ' + 'дня') // повертає 'Доброго дня'
console. log(a <= b || c !== d) // повертає true або false результат: в ці параметри попало 1 значення а10 = b10
console. log(myFunction(c, d)) // результат функції
