// ECMAScript 6 - появился в 2015 году
// Обьявление новых переменных
// let
// const
// Обьявление новых переменных был изначально, не популярен!
// var - не использовать

// const c = 10 // КОНСТАНТА обьявление переменнных и присваивание значения которое не может быль изменено!
// с = 20 - не возможно переприсвоить! Значение уже обьявлено и ето константа!

// let a // обьявление переменнных поторяе можно переприсваивать!
// a = 20 // переприсвоение значения
// a = true // переприсвоение значения
//    console.log(a) // вывод переменной в консоль

const myName = 'Roman' // обьявление переменной и присваивание значения (String)
console.log(myName) // вывод переменной со значением в консоль

const a = 10 // обьявление переменной с числовым типом (Number)
const b = 'abc' // обьявление переменной с строчным типом (String)